Script started on 2024-03-16 20:37:09-07:00 [TERM="xterm-256color" TTY="/dev/pts/0" COLUMNS="141" LINES="26"]
]0;stdsoul@csvm: ~/Documents/CS1B/hw05[01;32mstdsoul@csvm[00m:[01;34m~/Documents/CS1B/hw05[00m$ make s16 s16.o [K
g++ -g s16.cpp -o s16
g++ -c s16.cpp -o s16.o
]0;stdsoul@csvm: ~/Documents/CS1B/hw05[01;32mstdsoul@csvm[00m:[01;34m~/Documents/CS1B/hw05[00m$ gdb ./s16
[35;1m[35;1mGNU gdb [m[35;1m(Ubuntu 9.1-0ubuntu1) [m[35;1m9.1[m[35;1m
[m[mCopyright (C) 2020 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type "show copying" and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
    <http://www.gnu.org/software/gdb/documentation/>.

For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from [32m./s16[m...
(gdb) l
1	#include "hw05.h"
2	
3	int Sum(int *p, int k) {
4	int i;
5	int sum = 0;
6	for(i=0;i<k;++i) {
7	sum += *(p+i);
8	}
9	return sum;
10	}
(gdb) l
11	
12	int main() {
13	int *d, s;
14	d = new int[5];
15	// i n i t i a l i z e âˆ—d
16	s = Sum(d,5);
17	delete [] d;
18	return 0;
19	}
(gdb) b 8
Breakpoint 1 at [34m0x11ed[m: file [32ms16.cpp[m, line 9.
(gdb) r
Starting program: /home/stdsoul/Documents/CS1B/hw05/s16 

Breakpoint 1, [33mSum[m ([36mp[m=0x55555556aeb0, [36mk[m=5) at [32ms16.cpp[m:9
9	return sum;
(gdb) p sum
$1 = 0
(gdb) s
10	}
(gdb) p sum
$2 = 0
(gdb) p&[K &a[Ksum
$3 = (int *) [34m0x7fffffffdf4c[m
(gdb) b 17
Breakpoint 2 at [34m0x555555555220[m: file [32ms16.cpp[m, line 17.
(gdb) r
The program being debugged has been started already.
Start it from the beginning? (y or n) y
Starting program: /home/stdsoul/Documents/CS1B/hw05/s16 

Breakpoint 1, [33mSum[m ([36mp[m=0x55555556aeb0, [36mk[m=5) at [32ms16.cpp[m:9
9	return sum;
(gdb) n
10	}
(gdb) s

Breakpoint 2, [33mmain[m () at [32ms16.cpp[m:17
17	delete [] d;
(gdb) p *d
$4 = 0
(gdb) p s
$5 = 0
(gdb) p d
$6 = (int *) [34m0x55555556aeb0[m
(gdb) p *d
$7 = 0
(gdb) p &s
$8 = (int *) [34m0x7fffffffdf64[m
(gdb) exit
Undefined command: "exit".  Try "help".
(gdb) q
A debugging session is active.

	Inferior 1 [process 197863] will be killed.

Quit anyway? (y or n) y
]0;stdsoul@csvm: ~/Documents/CS1B/hw05[01;32mstdsoul@csvm[00m:[01;34m~/Documents/CS1B/hw05[00m$ exit
exit

Script done on 2024-03-16 20:53:22-07:00 [COMMAND_EXIT_CODE="0"]
